examples/log/20160324-1113/http_simple2.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
  <server host="182.92.162.159" port="9001" type="tcp"/>
</servers>

  <monitoring>
    <monitor host="myserver" type="snmp"/>
  </monitoring>
  
  <load>
  <arrivalphase phase="1" duration="10" unit="minute">
     <users interarrival="2" unit="second"/>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <request subst="true"> <http url="/users/online" method="POST" version="1.1" contents=" type=2&amp;page=1&amp;pagesize=10&amp;phone=19999999&amp;password=191&amp;profession=do191"/> 
    </request>
  </session>
 </sessions>


</tsung>